In [ ]:
*********DATA FRAMES************

In [ ]:
Definition: It is a two dimensioanl Data structure with columns of potentially different data types

In [ ]:
# components
    ---->Data
    ---->index
    ---->columns

In [ ]:
Syntax
    pandas.DataFrame(data,index,columns,dtype,copy)

In [ ]:
##creating empty data frame

In [4]:
import numpy as np
import pandas as pd

In [5]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [ ]:
# creating data frame from list

In [6]:
data=[10,20,30,40,50]
df=pd.DataFrame(data)
df

    0
0  10
1  20
2  30
3  40
4  50

In [7]:
name=['sai','tije','mala','devi','viji']
df1=pd.DataFrame(name)

In [8]:
df1

      0
0   sai
1  tije
2  mala
3  devi
4  viji

In [9]:
data1=[['sai',90],['tije',90],['mala',80],['devi',90],['viji',70]]
df2=pd.DataFrame(data1)
df2

      0   1
0   sai  90
1  tije  90
2  mala  80
3  devi  90
4  viji  70

In [ ]:
**give column names

In [10]:
data1=[['sai',90],['tije',90],['mala',80],['devi',90],['viji',70]]
df3=pd.DataFrame(data1,columns=['name',' marks'])
df3

   name   marks
0   sai      90
1  tije      90
2  mala      80
3  devi      90
4  viji      70

In [ ]:
change the data type

In [11]:
data1=[['sai',90],['tije',90],['mala',80],['devi',90],['viji',70]]
df4=pd.DataFrame(data1,columns=['name',' marks'],dtype=float)
df4

   name   marks
0   sai    90.0
1  tije    90.0
2  mala    80.0
3  devi    90.0
4  viji    70.0

In [ ]:
Creating dataframe from dictionary of nd arrays

In [15]:
data2={'Name':['sai','tije','mala','devi','viji'],'Marks':[90,80,70,60,50]}
df4=pd.DataFrame(data2,dtype=float)
df4

   Name  Marks
0   sai   90.0
1  tije   80.0
2  mala   70.0
3  devi   60.0
4  viji   50.0

In [ ]:
##in dict keys will be converted to column names